feat: Small Batch Apps specs, typeset scripts, section dividers
